#include <stdio.h>

int main(void) {
    int n; // Количество элементов для вывода
    
    printf("Ввод: ");
    // Проверка на корректный ввод
    if (scanf("%d", &n) != 1 && n <= 0) {
        return 1;
    }

    // Начальное значение последовательности
    unsigned long long current_value = 1; 
    
    int counter = 0; // Переменная-счетчиk

    printf("Последовательность (КБ -> МБ):\n");
    
    // Цикл while для генерации N элементов
    while (counter < n) 
    {
        // Выводим текущий элемент через пробел
        printf("%llu ", current_value);
        
        /* Вычисляем следующий элемент */
        current_value = current_value * 1024;
        
        /* Увеличиваем счетчик */
        counter++; 
    }
    // Разница между постфиксным (counter++) и префиксным (++counter) инкрементом:
    // Оба оператора увеличивают значение переменной на 1. Однако они возвращают разные значения в момент выполнения:
    // Постфиксный инкремент (counter++): Сначала возвращает текущее значение переменной, 
    // а затем увеличивает его на 1. (Сначала используем, потом увеличиваем).
    // Префиксный инкремент (++counter): Сначала увеличивает значение переменной на 1, 
    // а затем возвращает уже новое значение. (Сначала увеличиваем, потом используем).
}